#include "NKP_V2.h"

#ifndef I2C_ADDR
#define I2C_ADDR 0x69
#endif

#include "PuppyBotIMU.h"
#include "PuppyBotTurnPID.h"

void setup() {
  NKP_V2();
  initIMU();                            //ประกาศใช้งาน Gyro
  updateIMU_fine_offset_Yaw(200);       //หาค่า offset  ในห้ามขยับหุ่นยนต์
  set_data_for_turnDirection(3,15,60,2,0);      //กำหนดค่าสำหรับการเลีเยว  (องศาที่ยอมรับ Error ,ความเร็วน้อยสุด , ความเร็วมากสุด , KP ให้เลี้ยวเร็ว ,KD ลดการส่ายไปมา แนะนำ 0)
  wait();
                                              //เมือเปิดเครื่องมา จะได้มุมที่ประมาณ 180 องศ่า 
  // turn_270();                              //เลี้ยวซ้ายไป 90 องศา  = 180 =+90 = 270
  // turn_360();
  // turn_180();
  // turn_90();

  //turnByAngle(90);                            //เลี้ยวจากองศาเดิมไป 90 = หมุนขวา 90 องศา    -90 = หมุนซ้าย 90องศา
  
  //turnPID(90,15,60,2,0);                      //คำสั่งสำหรับเลี้ยวแบบกำหนด องศาตายตัว เชน หมุนไปที่ 90 องศา และสามารถ ตั้งความเร็ว KP KD ได้เอง 

  //moveStraightPID(0,90,50,1000,0.5,0,0,0);          //คำสั่งเดินตรงแบบจับเวลา(ทิศทาง 0=เดินหน้า,องศา,ความเร็ว , ระยะเวลา ,KP,KI = 0,KD=0);
  // MoveStraightDirection(0,1,50,2000,0.5,0,0,0);    //คำสั่งเดินตรงแบบกำหนดทิศทางและจับเวลา (ทิศทาง 0=เดินหน้า,ระบุทิศ 0 = 180 ,ความเร็ว , ระยะเวลา ,KP,KI = 0,KD=0);
                                                                                                        //      1 = 270 , 2=360 ,3=90 , 4=45 , 5=135, 6=225, 7=315 

}

void loop() {
  Serial.print(getContinuousYaw());
  Serial.print("  ");
  Serial.println(getYaw());
  delay(100);

}
